modules/front/controllers/UserController.php

    public function actionLogin()
    {
        $request = \Yii::$app->request;
        $phone = $request->post_nn('phone');
        $password = $request->post_nn('password');
        $user = User::find()->where(['phone' => $phone, "pwd" => md5($password)])->asArray()->one();
---
SELECT * FROM `user` WHERE (`phone`='15805963038') AND (`pwd`='e10adc3949ba59abbe56e057f20f883e')