modules/front/services/ProductService.php

SELECT COUNT(*) FROM `product` WHERE `status`=1
SELECT * FROM `product` WHERE (`status`=1) AND (`is_hot`=1) ORDER BY `create_time` DESC LIMIT 10
---
    public static function getHotProduct($pageSize) {
        $productList = Product::find()
            ->where(['status' => 1,'is_hot'=>1])
            ->limit($pageSize)
            ->orderBy('create_time desc')
            ->asArray()
            ->all();

SELECT * FROM `product` WHERE `product_id`='2'
---
    public static function getProductDetail($productId) {
        $product = Product::find()
            ->where(['product_id' => $productId])
            ->asArray()
            ->one();