modules/front/services/PublicService.php

    public static function getBanner($size) {
        $field = ['banner_id', 'pic_name', 'pic_url', 'jump_type', 'jump_url', 'jump_title'];
        $bananerData = Banner::find()->select($field)
            ->where(['type' => 1, 'status' => 1])
            ->limit($size)
            ->orderBy('create_time desc')
            ->asArray()
            ->all();
---
SELECT `banner_id`, `pic_name`, `pic_url`, `jump_type`, `jump_url`, `jump_title` FROM `banner` WHERE (`type`=1) AND (`status`=1) ORDER BY `create_time` DESC LIMIT 10