modules/product/controllers/ViewsController.php

    public function actionToProductEdit(){
        $id = \Yii::$app->request->get('product_id');
        $data = Product::find()->where(['product_id'=>$id])->asArray()->one();
---
SELECT * FROM `product` WHERE `product_id`='1'